d = {"apple": 20, "banana": 30, "orange": 25}
print(d)
print("apple" in d)
print("蓮霧" in d)
L = [1, 2, 3, 4, 5]
print(3 in L)
d = {"a": [1, 2, 3], "b": {"C": 4, "d": 5}}
print(d["a"])
print(d["a"][0])
print(d["b"])
print(d["b"]["C"])
grade = {
    "小明": {"國文": [90, 80, 70], "數學": [80, 90, 100], "英文": [70, 80, 90]},
    "李四": {"國文": [80, 90, 100], "數學": [70, 80, 90], "英文": [90, 80, 70]},
    "王五": {"國文": [90, 80, 70], "數學": [80, 90, 100], "英文": [70, 80, 90]},
}
print(grade["李四"]["國文"][0])
print(grade["王五"]["國文"][0])
print(grade["小明"]["國文"][1])
